##################### ---- ФУНКЦИИ ---- ##############################
# Задание 1:
# Спросите у пользователя строку НА Английском или целое предложение и
# удалите все глассные буквы там.
# То что осталось от строки выведите на экран.
# Строка не должна быть короче 10 символов.

# def del_vowels():
#
#     sentence = input("Введите предложение:").lower()
#     if len(sentence) < 10:
#         print('Введите больше 10 символов')
#     else:
#         return ''.join(s for s in sentence if s not in 'aoyeui')
#
# print(del_vowels())

# Задание 2:
# Вам дан набор данных accounts.
# Функция должна проходить по каждому листу состоящему из 3-х символов и
# найти ту где их сумма больше всего.

# accounts = [
#     [[1,5,5],[7,4,5],[1,3,5],[2,1,5],[7,3,9],[8,3,5],[1,5,0],[7,3,2],[9,3,5]],
#     [[1,5,3],[2,7,3],[6,3,5],[1,5,9],[7,3,3],[3,5,4],[1,5,6],[7,3,6],[3,5,8]],
#     [[1,5,3],[7,3,0],[3,5,4],[1,5,6],[7,3,2],[3,5,4],[1,5,9],[7,3,2],[3,5,0]],
#     [[1,5,1],[7,3,2],[3,5,3],[1,5,4],[7,3,5],[3,5,6],[1,5,7],[7,3,8],[3,5,9]],
# ]
#
# def count():
#
#     max_sum = []
#     for i in accounts:
#         for n in i:
#             sum_num = sum(n)
#             max_sum.append(sum_num)
#     print(max(max_sum))
#
# count()

# Задание 4:
# Известно что функция print() выводит на экран текст который Вы в ней указали.
# Известно что есть ещё один способ вывести на экран любой текст sys.stdout.write(), но его использовать нельзя.
# Так случилось что функция print поменяла своё имя и стала называться display.
# Выведите с помощью новой функции display() на экран следующий текст: "Теперь я тут PRINT()"
# Общее количество строк для решения этой задачи не может быть больше 2-х строк, иначе задание не принимается.


# from IPython.display import display
# display('Теперь я тут PRINT()')


# Задание 6:
# В Python есть такой тип Данных как Boolean...
# Создайте TUPLE который ТЕХНИЧЕСКИ состоит из 4 Булевых ЗНАЧЕНИЙ.

# tpl = ((45 == 45), (23 < 22), (True == 1),(False == 0) )
# print(tpl[0], tpl[1], tpl[2], tpl[3])

# Задание 10:
# Если вы были на Луне сейчас, ваш вес будет 16,5% от вашего веса земли.
# Для его расчета необходимо умножить на 0,165.
# Если в ближайшие 15 лет ваш вес будет увеличиваться на 1 кг каждый год.
# Какой будет ваш вес каждый год на Луне в следующем 15 лет?

# mas = float(input('Введите ваш вес:  '))
# mas_moon = mas * 0.165
# print("Ваш вес на луне: " + str(mas_moon))
# for i in range(15):
#    mas += 1 # увеличивание массы на 1
#    mas_moon = mas * 0.165
#    print("Масса на Земле = " + str(mas) + "   Масса на Луне = " + str(mas_moon) )
#

# Задание 11:
# Попросить пользователя ввести слова через пробел.
# Отсортировать слова по количеству символов и вывести на экран результат.

# Пример input: сон машина стол книга девочка
# Результат: сон стол книга машина девочка

# text = input('Введите слова через пробел: ')
# l = text.split(' ')
# q=""
# for i in sorted(l,key=lambda a: len(a)):
#     q = q + " " + i
# print(q)



# Задание 12:
# Напишите функцию который будет конвертировать Фаренгейт в Цельсии и
# наоборот.

# def far_cel():
#     far = float(input("Фаренгейт:"))
#     cel = 5.0*(far - 32) / 9
#     return cel
# print(far_cel())
#
# def cel_far():
#     cel = float(input("Цельсий:"))
#     far = (9 / 5.0 * cel) + 32
#     return far
# print(cel_far())

